---
kind: type
id: T:Autodesk.Revit.DB.Lighting.PointLightShape
source: html/54dba66a-07b0-2588-0e96-997497984e0b.htm
---
# Autodesk.Revit.DB.Lighting.PointLightShape

This class encapsulates a point light shape.

## Syntax (C#)
```csharp
public class PointLightShape : LightShape
```